In [1]:
!cat /etc/os-release

NAME="Ubuntu"
VERSION="20.04.6 LTS (Focal Fossa)"
ID=ubuntu
ID_LIKE=debian
PRETTY_NAME="Ubuntu 20.04.6 LTS"
VERSION_ID="20.04"
HOME_URL="https://www.ubuntu.com/"
SUPPORT_URL="https://help.ubuntu.com/"
BUG_REPORT_URL="https://bugs.launchpad.net/ubuntu/"
PRIVACY_POLICY_URL="https://www.ubuntu.com/legal/terms-and-policies/privacy-policy"
VERSION_CODENAME=focal
UBUNTU_CODENAME=focal

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

from sqlalchemy.engine import create_engine

%matplotlib inline

In [3]:
%load_ext sql
%config SqlMagic.displaylimit=50
%config SqlMagic.autopandas=True

There's a new jupysql version available (0.10.10), you're running 0.10.9. To upgrade: pip install jupysql --upgrade
Deploy Streamlit apps for free on Ploomber Cloud! Learn more: https://ploomber.io/s/signup

In [4]:
%sql postgresql://imdb:imdb_admin@postgres:5432/imdb_database

Connecting to 'postgresql://imdb:***@postgres:5432/imdb_database'

In [5]:
connection = create_engine('postgresql://imdb:imdb_admin@postgres:5432/imdb_database')

# Introduction to SQL (Structured Query Language)

##### Version 0.1

***

By Scott Coughlin (Northwestern IT Research Computing and Data Services)  
June 4th 2024

[Session 21](https://github.com/LSSTC-DSFP/Session-21) is primarily concerned with handling our data with efficiency.

Ideally, for any and every task we want to desire solutions that operate *faster*.

This can be accomplished many different ways:

$~~~~~~$build algorithms that execute faster

$~~~~~~$spread calculations over many different computers simultaneously

$~~~~~~$find a compact storage solution for the data so it can be accessed more quickly

In our introduction to SQL we will start with simple queries of existing tables, and discuss creating your own tables using `pandas` as a challenge problem.

## Problem 1) IMDb Data

Throughout the session we will use information from the [Internet Movie Database (IMDb)](https://www.imdb.com/) to illustrate various principles regarding databases.

A quick note on the provenance of this data. The files we have used to populate this data set are from [this website](https://relational.fit.cvut.cz/dataset/IMDb) and it may not be a list of every single movie on IMDb (there are no movies after 2004).

#### Please note that you can make an SQL command call from a jupyter cell by adding "%sql" in front of the SQL command you want to run, see examples below
```
## Perform a SQL command and see the results of the query
%sql SELECT * FROM imbd_movies;

## If you save to a variable, in this case "result", then the variable will be a `pandas` DataFrame based on the result of the query
result = %sql SELECT * FROM imdb_directors ORDER BY first_name LIMIT 10; 
```

Please execute the cell below to list all of the table names in the imbd_database database. You will want these table names to answer the questions that follow.

In [6]:
%sql \dt+

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

   Schema                   Name   Type Owner     Size Description
0  public         imdb_directors  table  imdb  4720 kB        None
1  public            imdb_movies  table  imdb    26 MB        None
2  public  imdb_movies_directors  table  imdb    16 MB        None
3  public     imdb_movies_genres  table  imdb    17 MB        None

In [7]:
imdb_movies = %sql SELECT * FROM imdb_movies;
imdb_directors = %sql SELECT * FROM imdb_directors
imdb_movies_directors = %sql SELECT * FROM imdb_movies_directors
imdb_movies_genres = %sql SELECT * FROM imdb_movies_genres

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

355146 rows affected.

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

86880 rows affected.

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

371180 rows affected.

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

395119 rows affected.

In [15]:
imdb_movies

        movie_id                                 name  year  rank
0              0                                  #28  2002   0.0
1              1  #7 Train: An Immigrant Journey, The  2000   0.0
2              2                                    $  1971   6.4
3              3                        $1,000 Reward  1913   0.0
4              4                        $1,000 Reward  1915   0.0
...          ...                                  ...   ...   ...
355141    378611                   nc Selim'in gzdesi  1950   0.0
355142    378612                       nz de mihlarim  1965   0.0
355143    378613                        egar a gerist  1998   0.0
355144    378614                              . 19,99  1998   6.3
355145    378615                              !Huff""  2004   0.0

[355146 rows x 4 columns]

**Problem 1a**

Using SQL, SELECT 10 movies from the imbd_movies table. Select 10 directors from imbd_directors and order by `first_name`.

In [16]:
%sql SELECT * FROM imdb_movies LIMIT 10;

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

10 rows affected.

   movie_id                                 name  year  rank
0         0                                  #28  2002   0.0
1         1  #7 Train: An Immigrant Journey, The  2000   0.0
2         2                                    $  1971   6.4
3         3                        $1,000 Reward  1913   0.0
4         4                        $1,000 Reward  1915   0.0
5         5                        $1,000 Reward  1923   0.0
6         6                      $1,000,000 Duck  1971   5.0
7         7               $1,000,000 Reward, The  1920   0.0
8         8               $10,000 Under a Pillow  1921   0.0
9         9                          $100,000.00  1915   0.0

In [21]:
%sql SELECT * FROM imdb_directors LIMIT 10;

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

10 rows affected.

   director_id          first_name    last_name
0            1                Todd            1
1            2                 Les  12 Poissons
2            3             Lejaren     a'Hiller
3            4                Nian            A
4            5            Khairiya    A-Mansour
5            6             Ricardo     A. Solla
6            8  Kodanda Rami Reddy           A.
7            9       Nageswara Rao           A.
8           10                Yuri           A.
9           11               Swamy       A.S.A.

**Problem 1b**

Using SQL, how many movies are there? How many directors are there?

In [23]:
%%sql 
    SELECT COUNT(*) AS number_of_movies
    From imdb_movies;

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

1 rows affected.

   number_of_movies
0            355146

In [24]:
%%sql 
    SELECT COUNT(*) AS number_of_directors
    From imdb_directors;

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

1 rows affected.

   number_of_directors
0                86880

*Write your answer here*

**Problem 1c**

Using SQL, determine how many movies are there after the year 2000?

In [27]:
%sql SELECT COUNT(*) AS movies_after_2000 FROM imdb_movies WHERE year > 2000;

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

1 rows affected.

   movies_after_2000
0              39586

*Write your answer here*

**Problem 1d**

How many different movie genres are there?

In [28]:
%sql SELECT COUNT(DISTINCT genre) AS number_of_genres FROM imdb_movies_genres;

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

1 rows affected.

   number_of_genres
0                21

In [31]:
%sql SELECT DISTINCT genre FROM imdb_movies_genres;

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

21 rows affected.

          genre
0     Animation
1         Crime
2       Romance
3   Documentary
4       Mystery
5       Musical
6         Music
7     Film-Noir
8       Fantasy
9         Short
10        Adult
11       Horror
12        Drama
13       Action
14     Thriller
15       Sci-Fi
16      Western
17       Comedy
18    Adventure
19          War
20       Family

*Write your answer here*

## Problem 2) Joins

We started this exercise with a goal of being efficient. And yet, the data have been organized across 4 different files (each sheet is effectively a unique csv file).

**Problem 2a**

Join `imdb_movies` and `imdb_movies_genres` together

In [32]:
%%sql
SELECT m.*, mg.genre
FROM imdb_movies m
INNER JOIN imdb_movies_genres mg ON m.movie_id = mg.movie_id;

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

395119 rows affected.

        movie_id                    name  year  rank      genre
0             13  $21 a Day Once a Month  1941   0.0  Animation
1             13  $21 a Day Once a Month  1941   0.0      Short
2             18              $40,000.00  1996   9.6     Comedy
3             31                   $pent  2000   4.3      Drama
4             73              burbs, The  1989   5.9     Comedy
...          ...                     ...   ...   ...        ...
395114    378593                 arkadas  1971   0.0      Drama
395115    378599             kisilik ask  2004   0.0      Drama
395116    378604     tekerlekli bisiklet  1962   0.0      Drama
395117    378605        yetimin izdirabi  1956   0.0      Drama
395118    378610                nc sayfa  1999   7.0      Drama

[395119 rows x 5 columns]

*write your answer here*

**Problem 2b**

Join `imdb_movies`, `imdb_movies_directors` and `imdb_directors` together

*write your answer here*

## Problem 3) Groups and Aggregates

Now that we know why the data has been organized in this way, we can leverage this unique structure in order to learn interesting properties of the data.

**Problem 3a**

In which year were the most movies made according to IMDb?

*write your answer here*

**Problem 3b**

How many "Action" movies where made after the year 1980? Before the year 1980?

*write your answer here*

**Problem 3c**

Select all films made by `Scorsese`. How many are there?

*write your answer here*

**Problem 3c**

According the the IMDb data, which director has directed the most movies?

*write your answer here*

**Problem 3d**

According the the IMDb data, which director has directed the most movies in each genre?

*write your answer here*

## Challenge Problem) Make your own tables

**Problem 1a**

Create a new TABLE.

**Problem 1b**

INSERT 3 rows into the TABLE you made above

**Problem 1c**

Create a pandas DataFrame and save as a SQL table

*** hint look at the `pandas.to_sql` documentation and note that we already made a "connection" variable called `connection` ***